{
  "projects": [
    {
      "id": 1,
      "title": "SDGA Website",
      "description": "A clean and responsive website created for the Saudi Digital Government Authority. The site highlights the authority’s vision of building a strong digital nation. It includes sections for services, initiatives, and news, with a user-friendly layout that works well on all devices. The design reflects Saudi Arabia’s official branding and follows modern web standards to ensure accessibility and performance.",
      "image": "/sdga-website.png",
      "demoLink": "View Live Demo",
      "url": "https://www.figma.com/@sdga"
    },
    {
      "id": 2,
      "title": "Movie Website",
      "description": "A dynamic movie browsing platform built with React and TMDB API. Features include movie search, trending movies display, detailed movie information, and a responsive design. Users can explore different movie categories and view trailers.",
      "image": "/movie-website.png",
      "demoLink": "View Live Demo",
      "url": "https://movie-site-1.netlify.app/"
    },
    {
      "id": 4,
      "title": "Electro Store",
      "description": "A modern electronics e-commerce website built with React. Features a clean product catalog with categories like laptops, smartphones, and accessories. Includes product filtering by price range, brand selection, and a responsive layout that adapts seamlessly to all devices.",
      "image": "/electro-website.png",
      "demoLink": "View Live Demo",
      "url": "https://electro-webite.netlify.app/"
    },
    {
      "id": 5,
      "title": "MATJRK E-commerce Gateway",
      "description": "An Arabic e-commerce platform that serves as a gateway for online business. Built with HTML, CSS, and JavaScript, featuring a modern landing page design that introduces users to digital commerce opportunities. Includes responsive sections for services, benefits, and getting started guides.",
      "image": "/matjrik-website.png",
      "demoLink": "View Live Demo",
      "url": "https://nadeenahmed420.github.io/MATJRK/"
    },
    {
      "id": 6,
      "title": "Fashion E-Commerce",
      "description": "A stylish fashion e-commerce website built with HTML, CSS, and JavaScript. Features a modern design with product galleries, and a shopping cart system. Each product has a detailed page, and related product recommendations. Implements responsive design for optimal viewing across all devices.",
      "image": "/e-commerce-website.png",
      "demoLink": "View Live Demo",
      "url": "https://nadeenahmed420.github.io/E-Commerce-Website-/"
    },
    {
      "id": 7,
      "title": "Interior Design Studio",
      "description": "A sleek interior design website crafted with HTML, CSS, and JavaScript. Features a dynamic home page, detailed about us section, comprehensive services page, and project portfolio showcase. Implements smooth animations and fully responsive design across all devices.",
      "image": "/interior-design-website.png",
      "demoLink": "View Live Demo",
      "url": "https://interiorr-design-website.netlify.app/"
    },
    {
      "id": 8,
      "title": "Admin Dashboard",
      "description": "A modern admin panel interface built with HTML, CSS, and JavaScript. Features a clean sidebar navigation, data visualization charts, user statistics widgets, and dark/light theme toggle. Includes responsive tables and interactive analytics displays.",
      "image": "/admin-dashboard.png",
      "demoLink": "View Live Demo",
      "url": "https://nadeenahmed420.github.io/Admin-Dashboard/"
    },
    {
      "id": 9,
      "title": "Academic Dashboard",
      "description": "A modern educational platform dashboard built with HTML, CSS, and JavaScript. Features student profile management, project tracking, and comprehensive course listings. Includes a responsive sidebar navigation with profile analytics, project submissions, and course progress monitoring.",
      "image": "/dashboard.png",
      "demoLink": "View Live Demo",
      "url": "https://nadeenahmed420.github.io/DashBoard/"
    }
  ]
}
